org/Doi-Peliti_Path_Integral_Methods.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: Doi-Peliti_Path_Integral_Methods
#+TITLE: Doi-Peliti Path Integral Methods
* [[file:The_information_geometry_of_2-field_functional_integrals_by_Eric_Smith_in_2019.org][The information geometry of 2-field functional integrals by Eric Smith in 2019]] 
* Vastola, J. J. (2019). Solving the chemical master equation for monomolecular reaction systems analytically: a Doi-Peliti path integral view. Retrieved from http://arxiv.org/abs/1911.00978
* Greenman CGreenman, C. D. (2019). __Duality relations between spatial birth-death processes and diffusions in Hilbert space__.
* Smith, E., & Krishnamurthy, S. (2018). Path-reversal, Doi-Peliti generating functionals, and dualities between dynamics and inference for stochastic processes. Retrieved from https://arxiv.org/pdf/1806.02001.pdf
* Greenman, C. D. (2018). Doi–Peliti path integral methods for stochastic systems with partial exclusion. __Physica A: Statistical Mechanics and Its Applications__, __505__, 211–221. https://doi.org/10.1016/j.physa.2018.03.045
* Smith, E., & Krishnamurthy, S. (2017). Flows, scaling, and the control of moment hierarchies for stochastic chemical reaction networks, 2–12. Retrieved from http://arxiv.org/abs/1706.08386
* Piñero, J., & Solé, R. (2015). Field theory of molecular cooperators, 9. Retrieved from http://arxiv.org/abs/1508.01422
* Smith, E. (2011). Large-deviation principles, stochastic effective actions, path entropies, and the structure and meaning of thermodynamic descriptions. __Reports on Progress in Physics__, __74__(4), 046601. https://doi.org/10.1088/0034-4885/74/4/046601
* Itakura, K., Ohkubo, J., & Sasa, S. (2010). Two Langevin equations in the Doi–Peliti formalism. __Journal of Physics A: Mathematical and Theoretical__, __43__(12), 125001. https://doi.org/10.1088/1751-8113/43/12/125001
* Dodd, P. J., & Ferguson, N. M. (2009). A many-body field theory approach to stochastic models in population biology. __PloS One__, __4__(9), e6855. https://doi.org/10.1371/journal.pone.0006855
* Champagnat, N., Ferrière, R., & Méléard, S. (2006). Unifying evolutionary dynamics: from individual stochastic processes to macroscopic models. __Theoretical Population Biology__, __69__(3), 297–321. https://doi.org/10.1016/j.tpb.2005.10.004
* Smith, E. (2006). Doi-Peliti Methods for Non-commuting Observables. Retrieved from http://www.santafe.edu/media/workingpapers/06-11-040.pdf
* Täuber, U. C., Howard, M., & Vollmayr-Lee, B. P. (2005). Applications of field-theoretic renormalization group methods to reaction–diffusion problems. __Journal of Physics A: Mathematical and General__, __38__(17), R79–R131. https://doi.org/10.1088/0305-4470/38/17/R01
* Kamenev, A. (2001). Keldysh and Doi-Peliti Techniques for out-of-Equilibrium Systems, (1), 19. Mesoscale and Nanoscale Physics; Disordered Systems and Neural Networks. Retrieved from http://arxiv.org/abs/cond-mat/0109316
* Eyink, G. L. (1996). Action principle in nonequilibrium statistical dynamics. __Physical Review E__, __54__(4), 3419–3435. https://doi.org/10.1103/PhysRevE.54.3419
* Gillespie, D. (1994). Why quantum mechanics cannot be formulated as a Markov process. __Physical Review A__, __49__(3), 1607–1612. https://doi.org/10.1103/PhysRevA.49.1607
* Peliti, L. (1985). Path integral approach to birth-death processes on a lattice. __Journal de Physique__, __46__(9), 1469–1483. https://doi.org/10.1051/jphys:019850046090146900
* Doi, M. (1976). Stochastic theory of diffusion-controlled reaction. __Journal of Physics A: Mathematical and General__, __9__(9), 1479–1495. https://doi.org/10.1088/0305-4470/9/9/009
* Doi, M. (1976). Second quantization representation for classical many-particle system. __Journal of Physics A: Mathematical and General__, __9__(9), 1465–1477. https://doi.org/10.1088/0305-4470/9/9/008
