content/posts/Doi-Peliti_Path_Integral_Methods.md
+++
title = "Doi-Peliti Path Integral Methods"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:16-04:00
slug = "Doi-Peliti_Path_Integral_Methods"
draft = false
+++

## [The information geometry of 2-field functional integrals by Eric Smith in 2019]({{< relref "The_information_geometry_of_2-field_functional_integrals_by_Eric_Smith_in_2019" >}}) {#the-information-geometry-of-2-field-functional-integrals-by-eric-smith-in-2019--the-information-geometry-of-2-field-functional-integrals-by-eric-smith-in-2019-dot-md}


## Vastola, J. J. (2019). Solving the chemical master equation for monomolecular reaction systems analytically: a Doi-Peliti path integral view. Retrieved from <http://arxiv.org/abs/1911.00978> {#vastola-j-dot-j-dot--2019--dot-solving-the-chemical-master-equation-for-monomolecular-reaction-systems-analytically-a-doi-peliti-path-integral-view-dot-retrieved-from-http-arxiv-dot-org-abs-1911-dot-00978}


## Greenman CGreenman, C. D. (2019). <span class="underline"><span class="underline">Duality relations between spatial birth-death processes and diffusions in Hilbert space</span></span>. {#greenman-cgreenman-c-dot-d-dot--2019--dot-dot}


## Smith, E., & Krishnamurthy, S. (2018). Path-reversal, Doi-Peliti generating functionals, and dualities between dynamics and inference for stochastic processes. Retrieved from <https://arxiv.org/pdf/1806.02001.pdf> {#smith-e-dot-and-krishnamurthy-s-dot--2018--dot-path-reversal-doi-peliti-generating-functionals-and-dualities-between-dynamics-and-inference-for-stochastic-processes-dot-retrieved-from-https-arxiv-dot-org-pdf-1806-dot-02001-dot-pdf}


## Greenman, C. D. (2018). Doi–Peliti path integral methods for stochastic systems with partial exclusion. <span class="underline"><span class="underline">Physica A: Statistical Mechanics and Its Applications</span></span>, <span class="underline"><span class="underline">505</span></span>, 211–221. <https://doi.org/10.1016/j.physa.2018.03.045> {#greenman-c-dot-d-dot--2018--dot-doi-peliti-path-integral-methods-for-stochastic-systems-with-partial-exclusion-dot-211-221-dot-https-doi-dot-org-10-dot-1016-j-dot-physa-dot-2018-dot-03-dot-045}


## Smith, E., & Krishnamurthy, S. (2017). Flows, scaling, and the control of moment hierarchies for stochastic chemical reaction networks, 2–12. Retrieved from <http://arxiv.org/abs/1706.08386> {#smith-e-dot-and-krishnamurthy-s-dot--2017--dot-flows-scaling-and-the-control-of-moment-hierarchies-for-stochastic-chemical-reaction-networks-2-12-dot-retrieved-from-http-arxiv-dot-org-abs-1706-dot-08386}


## Piñero, J., & Solé, R. (2015). Field theory of molecular cooperators, 9. Retrieved from <http://arxiv.org/abs/1508.01422> {#piñero-j-dot-and-solé-r-dot--2015--dot-field-theory-of-molecular-cooperators-9-dot-retrieved-from-http-arxiv-dot-org-abs-1508-dot-01422}


## Smith, E. (2011). Large-deviation principles, stochastic effective actions, path entropies, and the structure and meaning of thermodynamic descriptions. <span class="underline"><span class="underline">Reports on Progress in Physics</span></span>, \_\_74\_\_(4), 046601. <https://doi.org/10.1088/0034-4885/74/4/046601> {#smith-e-dot--2011--dot-large-deviation-principles-stochastic-effective-actions-path-entropies-and-the-structure-and-meaning-of-thermodynamic-descriptions-dot-74--4--046601-dot-https-doi-dot-org-10-dot-1088-0034-4885-74-4-046601}


## Itakura, K., Ohkubo, J., & Sasa, S. (2010). Two Langevin equations in the Doi–Peliti formalism. <span class="underline"><span class="underline">Journal of Physics A: Mathematical and Theoretical</span></span>, \_\_43\_\_(12), 125001. <https://doi.org/10.1088/1751-8113/43/12/125001> {#itakura-k-dot-ohkubo-j-dot-and-sasa-s-dot--2010--dot-two-langevin-equations-in-the-doi-peliti-formalism-dot-43--12--125001-dot-https-doi-dot-org-10-dot-1088-1751-8113-43-12-125001}


## Dodd, P. J., & Ferguson, N. M. (2009). A many-body field theory approach to stochastic models in population biology. <span class="underline"><span class="underline">PloS One</span></span>, \_\_4\_\_(9), e6855. <https://doi.org/10.1371/journal.pone.0006855> {#dodd-p-dot-j-dot-and-ferguson-n-dot-m-dot--2009--dot-a-many-body-field-theory-approach-to-stochastic-models-in-population-biology-dot-4--9--e6855-dot-https-doi-dot-org-10-dot-1371-journal-dot-pone-dot-0006855}


## Champagnat, N., Ferrière, R., & Méléard, S. (2006). Unifying evolutionary dynamics: from individual stochastic processes to macroscopic models. <span class="underline"><span class="underline">Theoretical Population Biology</span></span>, \_\_69\_\_(3), 297–321. <https://doi.org/10.1016/j.tpb.2005.10.004> {#champagnat-n-dot-ferrière-r-dot-and-méléard-s-dot--2006--dot-unifying-evolutionary-dynamics-from-individual-stochastic-processes-to-macroscopic-models-dot-69--3--297-321-dot-https-doi-dot-org-10-dot-1016-j-dot-tpb-dot-2005-dot-10-dot-004}


## Smith, E. (2006). Doi-Peliti Methods for Non-commuting Observables. Retrieved from <http://www.santafe.edu/media/workingpapers/06-11-040.pdf> {#smith-e-dot--2006--dot-doi-peliti-methods-for-non-commuting-observables-dot-retrieved-from-http-www-dot-santafe-dot-edu-media-workingpapers-06-11-040-dot-pdf}


## Täuber, U. C., Howard, M., & Vollmayr-Lee, B. P. (2005). Applications of field-theoretic renormalization group methods to reaction–diffusion problems. <span class="underline"><span class="underline">Journal of Physics A: Mathematical and General</span></span>, \_\_38\_\_(17), R79–R131. <https://doi.org/10.1088/0305-4470/38/17/R01> {#täuber-u-dot-c-dot-howard-m-dot-and-vollmayr-lee-b-dot-p-dot--2005--dot-applications-of-field-theoretic-renormalization-group-methods-to-reaction-diffusion-problems-dot-38--17--r79-r131-dot-https-doi-dot-org-10-dot-1088-0305-4470-38-17-r01}


## Kamenev, A. (2001). Keldysh and Doi-Peliti Techniques for out-of-Equilibrium Systems, (1), 19. Mesoscale and Nanoscale Physics; Disordered Systems and Neural Networks. Retrieved from <http://arxiv.org/abs/cond-mat/0109316> {#kamenev-a-dot--2001--dot-keldysh-and-doi-peliti-techniques-for-out-of-equilibrium-systems--1--19-dot-mesoscale-and-nanoscale-physics-disordered-systems-and-neural-networks-dot-retrieved-from-http-arxiv-dot-org-abs-cond-mat-0109316}


## Eyink, G. L. (1996). Action principle in nonequilibrium statistical dynamics. <span class="underline"><span class="underline">Physical Review E</span></span>, \_\_54\_\_(4), 3419–3435. <https://doi.org/10.1103/PhysRevE.54.3419> {#eyink-g-dot-l-dot--1996--dot-action-principle-in-nonequilibrium-statistical-dynamics-dot-54--4--3419-3435-dot-https-doi-dot-org-10-dot-1103-physreve-dot-54-dot-3419}


## Gillespie, D. (1994). Why quantum mechanics cannot be formulated as a Markov process. <span class="underline"><span class="underline">Physical Review A</span></span>, \_\_49\_\_(3), 1607–1612. <https://doi.org/10.1103/PhysRevA.49.1607> {#gillespie-d-dot--1994--dot-why-quantum-mechanics-cannot-be-formulated-as-a-markov-process-dot-49--3--1607-1612-dot-https-doi-dot-org-10-dot-1103-physreva-dot-49-dot-1607}


## Peliti, L. (1985). Path integral approach to birth-death processes on a lattice. <span class="underline"><span class="underline">Journal de Physique</span></span>, \_\_46\_\_(9), 1469–1483. <https://doi.org/10.1051/jphys:019850046090146900> {#peliti-l-dot--1985--dot-path-integral-approach-to-birth-death-processes-on-a-lattice-dot-46--9--1469-1483-dot-https-doi-dot-org-10-dot-1051-jphys-019850046090146900}


## Doi, M. (1976). Stochastic theory of diffusion-controlled reaction. <span class="underline"><span class="underline">Journal of Physics A: Mathematical and General</span></span>, \_\_9\_\_(9), 1479–1495. <https://doi.org/10.1088/0305-4470/9/9/009> {#doi-m-dot--1976--dot-stochastic-theory-of-diffusion-controlled-reaction-dot-9--9--1479-1495-dot-https-doi-dot-org-10-dot-1088-0305-4470-9-9-009}


## Doi, M. (1976). Second quantization representation for classical many-particle system. <span class="underline"><span class="underline">Journal of Physics A: Mathematical and General</span></span>, \_\_9\_\_(9), 1465–1477. <https://doi.org/10.1088/0305-4470/9/9/008> {#doi-m-dot--1976--dot-second-quantization-representation-for-classical-many-particle-system-dot-9--9--1465-1477-dot-https-doi-dot-org-10-dot-1088-0305-4470-9-9-008}
